In [1]:
import pandas as pd

In [4]:
cols = ['ID','Age','Gender','Occupation','Code']
df1= pd.read_table("http://bit.ly/movieusers", sep='|',header=None , names= cols, index_col='ID')

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

In [5]:
df1.head()

    Age Gender  Occupation   Code
ID
1    24      M  technician  85711
2    53      F       other  94043
3    23      M      writer  32067
4    24      M  technician  43537
5    33      F       other  15213

In [7]:
df1.shape

(943, 4)

#### Find number of Duplicated Code

In [13]:
df1.Code.duplicated().sum()

148

In [17]:
df1.loc[df1.Code.duplicated()].head(5)

    Age Gender     Occupation   Code
ID
29   41      M     programmer  94043
52   18      F        student  55105
56   25      M      librarian  46260
84   32      M      executive  55369
92   32      M  entertainment  80525

#### Find Rows which are identical in Dataframe

In [15]:
df1.duplicated().sum()

7

In [19]:
df1.loc[df1.duplicated(keep='first')]

     Age Gender Occupation   Code
ID
496   21      F    student  55414
572   51      M   educator  20003
621   17      M    student  60402
684   28      M    student  55414
733   44      F      other  60630
805   27      F      other  20009
890   32      M    student  97301

In [20]:
df1.loc[df1.duplicated(keep='last')]

     Age Gender Occupation   Code
ID
67    17      M    student  60402
85    51      M   educator  20003
198   21      F    student  55414
350   32      M    student  97301
428   28      M    student  55414
437   27      F      other  20009
460   44      F      other  60630

In [21]:
df1.loc[df1.duplicated(keep=False)]

     Age Gender Occupation   Code
ID
67    17      M    student  60402
85    51      M   educator  20003
198   21      F    student  55414
350   32      M    student  97301
428   28      M    student  55414
437   27      F      other  20009
460   44      F      other  60630
496   21      F    student  55414
572   51      M   educator  20003
621   17      M    student  60402
684   28      M    student  55414
733   44      F      other  60630
805   27      F      other  20009
890   32      M    student  97301

#### Apart from first instance Drop the Duplicates

In [23]:
df1.drop_duplicates(keep='first').shape

(936, 4)

### It drops all 7 duplicate row keeping the first instance

#### Find Duplicates considering only Age and Code columns

In [25]:
df1.duplicated(subset=['Age','Code']).sum()

16

In [28]:
df1.drop_duplicates(subset=['Age','Code'],keep='first').shape

(927, 4)